app/Controllers/Beasiswa.php

    public function save()
    {
        //menyiapkan slug
        if (!$this->validate(
            [
                'jenis' => 'required|is_unique[beasiswa.jenis_beasiswa]',
                'tujuan' => 'required',
                'informasi' => 'required'
            ]
        )) {
            // $validation = \Config\Services::validation();
            // dd($validation);
            return redirect()->to(base_url() . '/beasiswa/create')->withInput();
        }
        $slug = url_title($this->request->getVar('jenis'), '-', true);
        //menyimpan newline di database
        // $informasi = nl2br($this->request->getVar('informasi'));
        $this->beasiswaModel->save([
            'jenis_beasiswa' => $this->request->getVar('jenis'),
            'slug' => $slug,
            'beasiswa_untuk' => $this->request->getVar('tujuan'),
            // 'informasi'=>$this->request->getVar('informasi')
            'informasi' => $this->request->getVar('informasi')
        ]);
---
INSERT INTO `beasiswa` (`jenis_beasiswa`, `slug`, `beasiswa_untuk`, `informasi`, `created_at`, `updated_at`) VALUES ('Beasiswa Internal', 'beasiswa-internal', 'Internal', 'Beasiswa internal adalah beasiswa yang diberikan kepada calon mahasiswa yang merupakan karyawan/staff/petinggi Universitas Utomo, ataupun anak kandung atau anak angkat dari karyawan/staff/petinggi Universitas Utomo.', '2022-05-18 07:28:31', '2022-05-18 07:28:31')

    public function delete($id){
        $this->beasiswaModel->delete($id);
---
DELETE FROM `beasiswa`
WHERE `id` IN ('17')

    public function update($id){
        $beasiswaLama = $this->beasiswaModel->getBeasiswa($this->request->getVar('slug'));
        if($beasiswaLama['jenis_beasiswa']==$this->request->getVar('jenis')){
            $rule_jenis='required';
        }
        else{
            $rule_jenis='required|is_unique[beasiswa.jenis_beasiswa]';
        }
        if (!$this->validate(
            [
                'jenis' => $rule_jenis,
                'tujuan' => 'required',
                'informasi' => 'required'
            ]
        )) {
            // $validation = \Config\Services::validation();
            // dd($validation);
            return redirect()->to(base_url() . '/beasiswa/edit/'.$this->request->getVar('slug'))->withInput();
        }
        $slug = url_title($this->request->getVar('jenis'), '-', true);
        //menyimpan newline di database
        // $informasi = nl2br($this->request->getVar('informasi'));
        $this->beasiswaModel->save([
            'id'=>$id,
            'jenis_beasiswa' => $this->request->getVar('jenis'),
            'slug' => $slug,
            'beasiswa_untuk' => $this->request->getVar('tujuan'),
            // 'informasi'=>$this->request->getVar('informasi')
            'informasi' => $this->request->getVar('informasi')
        ]);
---
UPDATE `beasiswa` SET `jenis_beasiswa` = 'Beasiswa Prestasi', `slug` = 'beasiswa-prestasi', `beasiswa_untuk` = 'Calon Mahasiswa dan Mahasiswa Aktif', `informasi` = 'Beasiswa Prestasi Utomo adalah beasiswa bagi calon mahasiswa yang diberikan bagi lulusan SMA/Sederajat dari seluruh nusantara yang memiliki prestasi pada bidang akademik dan non-akademik (olahraga/seni) dalam tingkat nasional atau internasional.\r\n\r\nBesaran Beasiswa: 100%\r\n\r\nMasa Berlaku Beasiswa : Maksimal 8 Semester untuk Program Sarjana dan Maksimal 6 Semester untuk Program Diploma', `updated_at` = '2022-05-18 07:31:16'
WHERE `beasiswa`.`id` IN ('1')