app/Models/BeasiswaModel.php

    public function getBeasiswa($slug=false){
        if($slug==false){
            return $this->findAll();
        }
        return $this->where(['slug'=>$slug])->first();
---
SELECT *
FROM `beasiswa`
SELECT *
FROM `beasiswa`
WHERE `slug` = 'beasiswa-prestasi'
 LIMIT 1